"""
题目1：删除如下列表中的"矮穷丑"，写出 2 种或以上方法：

info = ["yuze", 18, "男", "矮穷丑", ["高", "富", "帅"], True, None, "狼的眼睛是啥样的"]
"""
info = ["yuze", 18, "男", "矮穷丑", ["高", "富", "帅"], True, None, "狼的眼睛是啥样的"]
# info.remove("矮穷丑")
# print(info)
# info.pop(3)
# print(info)

"""
题目2：现在有一个列表 li2=[1, 2, 3, 4, 5]，

请通过相关的操作改成 li2 =[0, 1, 2, 3, 66, 4, 5, 11, 22, 33]。
"""
# li2 = [1, 2, 3, 4, 5]
# # 在索引0前面加一个数字0
# li2.insert(0, 0)
# # print(li2)
# li2.insert(4, 66)
# # print(li2)
# # 在list后追加三个数字
# for i in range(3):
#     data = 11 * (i + 1)
#     li2.append(data)
# print(li2)

"""
题目3：下面列表定义正确的是

A. ['a' 'b' 'c']

B. [1:2:3]

C. [1,[],2.5,'a']

答案：C
"""
list_c = [1, [], 2.5, 'a']
# print(list_c)

"""
题目4：有列表如下

ls = ['心蓝',18,['健身','妹子'],[['刘德华',56],['张学友',57]]]

请用列表索引的方式输出'妹子'

请用列表索引的方式输出'刘德华'
"""
# ls = ['心蓝', 18, ['健身', '妹子'], [['刘德华', 56], ['张学友', 57]]]
# # 请用列表索引的方式输出'妹子'
# print(ls[2][1])
# # 请用列表索引的方式输出'刘德华'
# print(ls[3][0][0])

"""
题目5：有列表如下

ls = ['b','c']

请编写代码在ls的最后添加元素'd'，

请编写代码在ls的开头添加元素'a'
"""
# ls = ['b', 'c']
# # 请编写代码在ls的最后添加元素'd'，
# ls.append('d')
# print(ls)
# # 请编写代码在ls的开头添加元素'a'
# ls.insert(0, 'a')
# print(ls)

"""
题目6：有列表如下

ls = ['a','b','c']

请编写代码，删除元素'b'
"""
# ls = ['a', 'b', 'c']
# ls.remove('b')    # 根据值删除
# print(ls)
# ls.pop(1)  # 根据值的索引删除
# print(ls)

"""
题目7：有列表如下

ls = ['心蓝',18,['健身','妹子'],[['刘德华',56],['张学友',57]]]

请编写代码修改心蓝的不良爱好'妹子'为'阅读'
"""
# ls = ['心蓝', 18, ['健身', '妹子'], [['刘德华', 56], ['张学友', 57]]]
# ls[2][1] = '阅读'
# print(ls)

"""
题目8：有列表如下

ls = [2,1,3]

请编写代码对ls进行从大到小排序
"""
# ls = [2,1,3]
# # 先进行排序
# ls.sort()
# # 再倒序
# ls.reverse()
# print(ls)

"""
题目9：有列表如下

ls = ['我', '爱', '学', '习', '天', '天', '向', '上']

请编写代码将ls中的字符串元素拼接成字符串'我爱学习天天向上'
"""
ls = ['我', '爱', '学', '习', '天', '天', '向', '上']
print(''.join(ls))